codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz2048efh124.h
#define _CNSTATH_CNSTATH0_POSITION               0x00000000
#define _CNSTATH_CNSTATH0_MASK                   0x00000001
#define _CNSTATH_CNSTATH0_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH1_POSITION               0x00000001
#define _CNSTATH_CNSTATH1_MASK                   0x00000002
#define _CNSTATH_CNSTATH1_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH4_POSITION               0x00000004
#define _CNSTATH_CNSTATH4_MASK                   0x00000010
#define _CNSTATH_CNSTATH4_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH5_POSITION               0x00000005
#define _CNSTATH_CNSTATH5_MASK                   0x00000020
#define _CNSTATH_CNSTATH5_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH6_POSITION               0x00000006
#define _CNSTATH_CNSTATH6_MASK                   0x00000040
#define _CNSTATH_CNSTATH6_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH8_POSITION               0x00000008
#define _CNSTATH_CNSTATH8_MASK                   0x00000100
#define _CNSTATH_CNSTATH8_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH9_POSITION               0x00000009
#define _CNSTATH_CNSTATH9_MASK                   0x00000200
#define _CNSTATH_CNSTATH9_LENGTH                 0x00000001

#define _CNSTATH_CNSTATH10_POSITION              0x0000000A
#define _CNSTATH_CNSTATH10_MASK                  0x00000400
#define _CNSTATH_CNSTATH10_LENGTH                0x00000001

#define _CNSTATH_CNSTATH12_POSITION              0x0000000C
#define _CNSTATH_CNSTATH12_MASK                  0x00001000
#define _CNSTATH_CNSTATH12_LENGTH                0x00000001

#define _CNSTATH_CNSTATH13_POSITION              0x0000000D
#define _CNSTATH_CNSTATH13_MASK                  0x00002000
#define _CNSTATH_CNSTATH13_LENGTH                0x00000001

#define _CNSTATH_w_POSITION                      0x00000000
#define _CNSTATH_w_MASK                          0xFFFFFFFF
#define _CNSTATH_w_LENGTH                        0x00000020

#define _CNNEH_CNNEH0_POSITION                   0x00000000
#define _CNNEH_CNNEH0_MASK                       0x00000001
#define _CNNEH_CNNEH0_LENGTH                     0x00000001

#define _CNNEH_CNNEH1_POSITION                   0x00000001
#define _CNNEH_CNNEH1_MASK                       0x00000002
#define _CNNEH_CNNEH1_LENGTH                     0x00000001

#define _CNNEH_CNNEH4_POSITION                   0x00000004
#define _CNNEH_CNNEH4_MASK                       0x00000010
#define _CNNEH_CNNEH4_LENGTH                     0x00000001

#define _CNNEH_CNNEH5_POSITION                   0x00000005
#define _CNNEH_CNNEH5_MASK                       0x00000020
#define _CNNEH_CNNEH5_LENGTH                     0x00000001

#define _CNNEH_CNNEH6_POSITION                   0x00000006
#define _CNNEH_CNNEH6_MASK                       0x00000040
#define _CNNEH_CNNEH6_LENGTH                     0x00000001

#define _CNNEH_CNNEH8_POSITION                   0x00000008
#define _CNNEH_CNNEH8_MASK                       0x00000100
#define _CNNEH_CNNEH8_LENGTH                     0x00000001

#define _CNNEH_CNNEH9_POSITION                   0x00000009
#define _CNNEH_CNNEH9_MASK                       0x00000200
#define _CNNEH_CNNEH9_LENGTH                     0x00000001

#define _CNNEH_CNNEH10_POSITION                  0x0000000A
#define _CNNEH_CNNEH10_MASK                      0x00000400
#define _CNNEH_CNNEH10_LENGTH                    0x00000001

#define _CNNEH_CNNEH12_POSITION                  0x0000000C
#define _CNNEH_CNNEH12_MASK                      0x00001000
#define _CNNEH_CNNEH12_LENGTH                    0x00000001

#define _CNNEH_CNNEH13_POSITION                  0x0000000D
#define _CNNEH_CNNEH13_MASK                      0x00002000
#define _CNNEH_CNNEH13_LENGTH                    0x00000001

#define _CNFH_CNFH0_POSITION                     0x00000000
#define _CNFH_CNFH0_MASK                         0x00000001
#define _CNFH_CNFH0_LENGTH                       0x00000001

#define _CNFH_CNFH1_POSITION                     0x00000001
#define _CNFH_CNFH1_MASK                         0x00000002
#define _CNFH_CNFH1_LENGTH                       0x00000001

#define _CNFH_CNFH4_POSITION                     0x00000004
#define _CNFH_CNFH4_MASK                         0x00000010
#define _CNFH_CNFH4_LENGTH                       0x00000001

#define _CNFH_CNFH5_POSITION                     0x00000005
#define _CNFH_CNFH5_MASK                         0x00000020
#define _CNFH_CNFH5_LENGTH                       0x00000001

#define _CNFH_CNFH6_POSITION                     0x00000006
#define _CNFH_CNFH6_MASK                         0x00000040
#define _CNFH_CNFH6_LENGTH                       0x00000001

#define _CNFH_CNFH8_POSITION                     0x00000008
#define _CNFH_CNFH8_MASK                         0x00000100
#define _CNFH_CNFH8_LENGTH                       0x00000001

#define _CNFH_CNFH9_POSITION                     0x00000009
#define _CNFH_CNFH9_MASK                         0x00000200
#define _CNFH_CNFH9_LENGTH                       0x00000001

#define _CNFH_CNFH10_POSITION                    0x0000000A
#define _CNFH_CNFH10_MASK                        0x00000400
#define _CNFH_CNFH10_LENGTH                      0x00000001

#define _CNFH_CNFH12_POSITION                    0x0000000C
#define _CNFH_CNFH12_MASK                        0x00001000
#define _CNFH_CNFH12_LENGTH                      0x00000001

#define _CNFH_CNFH13_POSITION                    0x0000000D
#define _CNFH_CNFH13_MASK                        0x00002000
#define _CNFH_CNFH13_LENGTH                      0x00000001

#define _ANSELJ_ANSJ8_POSITION                   0x00000008
#define _ANSELJ_ANSJ8_MASK                       0x00000100
#define _ANSELJ_ANSJ8_LENGTH                     0x00000001

#define _ANSELJ_ANSJ9_POSITION                   0x00000009
#define _ANSELJ_ANSJ9_MASK                       0x00000200
#define _ANSELJ_ANSJ9_LENGTH                     0x00000001

#define _ANSELJ_ANSJ11_POSITION                  0x0000000B
#define _ANSELJ_ANSJ11_MASK                      0x00000800
#define _ANSELJ_ANSJ11_LENGTH                    0x00000001

#define _ANSELJ_w_POSITION                       0x00000000
#define _ANSELJ_w_MASK                           0xFFFFFFFF
#define _ANSELJ_w_LENGTH                         0x00000020

#define _TRISJ_TRISJ0_POSITION                   0x00000000
#define _TRISJ_TRISJ0_MASK                       0x00000001
#define _TRISJ_TRISJ0_LENGTH                     0x00000001

#define _TRISJ_TRISJ1_POSITION                   0x00000001
#define _TRISJ_TRISJ1_MASK                       0x00000002
#define _TRISJ_TRISJ1_LENGTH                     0x00000001

#define _TRISJ_TRISJ2_POSITION                   0x00000002
#define _TRISJ_TRISJ2_MASK                       0x00000004
#define _TRISJ_TRISJ2_LENGTH                     0x00000001

#define _TRISJ_TRISJ4_POSITION                   0x00000004
#define _TRISJ_TRISJ4_MASK                       0x00000010
#define _TRISJ_TRISJ4_LENGTH                     0x00000001

